{
  "fixed-feasts": {
    "feasts": {
      "mary_nativity": "ميلاد العذراء مريم",
      "transfiguration": "التجلي",
      "candlemas": "دخول المسيح إلى الهيكل",
      "john_baptist_nativity": "ميلاد يوحنا المعمدان",
      "theophany": "الظهور الإلهي (الغطاس)",
      "christmas_orthodox": "عيد الميلاد (أرثوذكسي)",
      "immaculate_conception": "الحبل بلا دنس",
      "christmas": "عيد الميلاد",
      "holy_cross": "عيد الصليب",
      "annunciation": "البشارة",
      "all_saints": "عيد جميع القديسين",
      "assumption": "انتقال العذراء",
      "epiphany": "الغطاس"
    },
    "tooltip_year": "أدخل السنة الميلادية لحساب الأعياد المسيحية الثابتة",
    "desc": {
      "all_saints": "يوم لتكريم جميع القديسين، المعروفين وغير المعروفين، يحتفل به في الكنيسة الغربية في 1 نوفمبر",
      "john_baptist_nativity": "الاحتفال بميلاد يوحنا المعمدان، سابق المسيح، في 24 يونيو",
      "candlemas": "يحيي ذكرى تقديم يسوع في الهيكل وتطهير مريم، يحتفل به في 2 فبراير",
      "theophany": "احتفال الكنيسة الأرثوذكسية الشرقية بمعمودية المسيح وظهوره كإله، في 19 يناير (6 يناير بالتقويم اليولياني)",
      "annunciation": "يحتفل بإعلان الملاك جبرائيل للعذراء مريم أنها ستحبل وتلد يسوع، في 25 مارس",
      "transfiguration": "يحيي ذكرى تجلي يسوع على الجبل أمام بطرس ويعقوب ويوحنا، في 6 أغسطس",
      "christmas": "يحتفل بميلاد يسوع المسيح في 25 ديسمبر حسب التقليد الغربي",
      "christmas_orthodox": "يحتفل بميلاد يسوع المسيح في 7 يناير (25 ديسمبر بالتقويم اليولياني) حسب التقليد الأرثوذكسي الشرقي",
      "epiphany": "يحتفل بزيارة المجوس ليسوع الطفل، يحتفل به في 6 يناير حسب التقليد الغربي",
      "assumption": "يحتفل بصعود العذراء مريم إلى السماء بالروح والجسد، في 15 أغسطس",
      "mary_nativity": "يحتفل بميلاد العذراء مريم، أم يسوع، في 8 سبتمبر",
      "holy_cross": "يحيي ذكرى العثور على الصليب الحقيقي على يد القديسة هيلانة، يحتفل به في 14 سبتمبر",
      "immaculate_conception": "عيد كاثوليكي يحتفل بحبل مريم بلا خطيئة أصلية، في 8 ديسمبر"
    },
    "input_title": "أدخل السنة",
    "info_title": "عن الأعياد المسيحية الثابتة",
    "error_year_range": "يجب أن تكون السنة بين 1 و 9999",
    "calculate_btn": "احسب",
    "info_traditions": "بعض الأعياد تحتفل بها الكنائس الغربية والشرقية معاً، بينما البعض الآخر خاص بتقليد واحد",
    "feasts_for_year": "الأعياد الثابتة للسنة",
    "error_invalid_input": "الرجاء إدخال سنة صحيحة",
    "western": "غربي",
    "gregorian_year": "السنة الميلادية",
    "info_julian": "التواريخ الأرثوذكسية الشرقية المعروضة هي تواريخ التقويم اليولياني محولة إلى الميلادي (فرق 13 يوماً)",
    "info_fixed": "الأعياد الثابتة تحدث في نفس التاريخ من كل عام، على عكس الأعياد المتنقلة التي تعتمد على عيد الفصح",
    "eastern": "شرقي",
    "empty_state": "أدخل سنة لعرض الأعياد المسيحية الثابتة لتلك السنة",
    "footer_note": "التواريخ المعروضة هي بالتقويم الميلادي. التواريخ الأرثوذكسية الشرقية تراعي فرق التقويم اليولياني 13 يوماً.",
    "both_traditions": "كلا التقليدين",
    "enter_year": "أدخل السنة"
  },
  "fixed-christian-feasts": {
    "description": "احسب تواريخ الأعياد المسيحية الثابتة مثل عيد الميلاد والغطاس والبشارة لأي سنة في التقليدين الغربي والشرقي.",
    "title": "حاسبة الأعياد المسيحية الثابتة"
  },
  "movable-feasts": {
    "feasts": {
      "ash_wednesday": "أربعاء الرماد",
      "septuagesima": "الأحد السبعيني",
      "pentecost": "العنصرة",
      "divine_mercy": "أحد الرحمة الإلهية",
      "easter": "عيد الفصح",
      "holy_saturday": "سبت النور",
      "maundy_thursday": "خميس العهد",
      "good_friday": "الجمعة العظيمة",
      "corpus_christi": "عيد جسد المسيح",
      "palm_sunday": "أحد الشعانين",
      "ascension": "الصعود",
      "quinquagesima": "الأحد الخمسيني",
      "easter_monday": "إثنين الفصح",
      "trinity_sunday": "أحد الثالوث",
      "sexagesima": "الأحد الستيني",
      "laetare_sunday": "أحد الفرح"
    },
    "calculate_btn": "احسب",
    "tooltip_year": "أدخل السنة الميلادية لحساب الأيام المقدسة المسيحية المتنقلة",
    "info_movable": "الأعياد المتنقلة تتغير تواريخها كل عام بناءً على حساب عيد الفصح",
    "empty_state": "أدخل سنة لعرض الأيام المقدسة المسيحية المتنقلة لتلك السنة",
    "desc": {
      "sexagesima": "الأحد الثاني قبل الصوم الكبير، حوالي 60 يوماً قبل الفصح",
      "easter_monday": "اليوم التالي لأحد الفصح، يحتفل به كعطلة رسمية في العديد من البلدان",
      "laetare_sunday": "الأحد الرابع من الصوم الكبير، يعرف أيضاً بأحد الفرح",
      "good_friday": "يحيي ذكرى صلب يسوع المسيح وموته على الجلجلة",
      "divine_mercy": "يحتفل به في الأحد التالي للفصح، يركز على رحمة الله",
      "easter": "يحتفل بقيامة يسوع المسيح من بين الأموات",
      "ascension": "يحيي ذكرى صعود يسوع المسيح إلى السماء بعد 40 يوماً من الفصح",
      "trinity_sunday": "يحتفل بعقيدة الثالوث المسيحية: الآب والابن والروح القدس",
      "maundy_thursday": "يحيي ذكرى العشاء الأخير ليسوع مع تلاميذه",
      "septuagesima": "الأحد الثالث قبل الصوم الكبير، حوالي 70 يوماً قبل الفصح",
      "palm_sunday": "يحيي ذكرى دخول يسوع المنتصر إلى أورشليم، قبل أسبوع من الفصح",
      "holy_saturday": "اليوم بين الجمعة العظيمة وأحد الفصح، يعرف أيضاً بالسبت المقدس",
      "quinquagesima": "الأحد قبل بداية الصوم الكبير، حوالي 50 يوماً قبل الفصح",
      "ash_wednesday": "اليوم الأول من الصوم الكبير، يتميز برماد التوبة",
      "pentecost": "يحتفل بحلول الروح القدس على الرسل، بعد 50 يوماً من الفصح",
      "corpus_christi": "يكرم القربان المقدس، يحتفل به في الخميس بعد أحد الثالوث"
    },
    "input_title": "أدخل السنة",
    "easter_day": "يوم الفصح",
    "western_tradition": "التقليد الغربي",
    "info_title": "عن الأيام المقدسة المسيحية المتنقلة",
    "info_computus": "يحسب عيد الفصح باستخدام خوارزمية الحساب، التي تحدد أول أحد بعد أول قمر كامل بعد الاعتدال الربيعي",
    "eastern_tradition": "التقليد الشرقي",
    "gregorian_year": "السنة الميلادية",
    "western_easter": "الفصح الغربي",
    "eastern_easter": "الفصح الشرقي",
    "error_invalid_input": "الرجاء إدخال سنة صحيحة",
    "info_difference": "تختلف تواريخ الفصح الغربي والشرقي بسبب اختلاف أنظمة التقويم (الميلادي واليولياني) وطرق الحساب",
    "error_year_range": "يجب أن تكون السنة بين 1 و 9999",
    "footer_note": "تحسب التواريخ باستخدام خوارزمية الحساب. الغربي يستخدم التقويم الميلادي، الشرقي يستخدم التقويم اليولياني محولاً إلى الميلادي.",
    "enter_year": "أدخل السنة"
  },
  "movable-christian-holy-days": {
    "title": "حاسبة الأيام المقدسة المسيحية المتنقلة",
    "description": "احسب تواريخ الأيام المقدسة المسيحية المتنقلة مثل الفصح وأربعاء الرماد والعنصرة والصعود لأي سنة في التقليدين الغربي والشرقي."
  }
}
